# Description

The **`DriverEntry`** function includes a call to **`ExReleasePushLockExclusive`** at the end. This is problematic because this lock is supposed to be acquired and released by the same thread. **`DriverEntry`** runs in a different thread than the ones executing **`FileCreationThread`** and **`FileMoveThread`**. Releasing a lock in a different thread than the one that acquired it can lead to a BSOD due to a violation of the lock's usage contract.

Link to this Memory Dump: https://mega.nz/file/ihVVjKwY#eNYteblfHDwYJhsusYA6C2CLr-mmfi7yukzW-nOs3MQ

```c
#include <ntifs.h>
#include <ntstrsafe.h>

typedef struct _SYNC_RESOURCES {
    EX_PUSH_LOCK FilePushLock;
} SYNC_RESOURCES, * PSYNC_RESOURCES;

// Thread function for creating files.
NTSTATUS FileCreationThread(PVOID Context) {
    PSYNC_RESOURCES SyncRes = (PSYNC_RESOURCES)Context;
    UNICODE_STRING uniFilePath;
    WCHAR filePathBuffer[150];
    char dataToWrite[] = "Hello, World!\r\n";
    IO_STATUS_BLOCK ioStatusBlock;

    KeEnterCriticalRegion();  // Disable normal kernel APCs before acquiring Pushlock.
    ExAcquirePushLockExclusive(&SyncRes->FilePushLock); // Acquire Pushlock for exclusive access.

    // Loop to create a series of files.
    for (int i = 0; i < 1000; i++) {
        // Prepare file path.
        RtlStringCchPrintfW(filePathBuffer, sizeof(filePathBuffer) / sizeof(WCHAR), L"\\DosDevices\\C:\\Temp\\file_%d.txt", i);
        RtlInitUnicodeString(&uniFilePath, filePathBuffer);


    fffff6840aecf3c8 0xfffff6840aecf3c8
    fffff6840aecf408 0xfffff6840aecf408
    000000000000000f 0xf

1 thread [stats]: ffff9101464f6040
    fffff80253c201c6 nt!KiSwapContext+0x76
    fffff80253a6c9d5 nt!KiSwapThread+0xab5
    fffff80253a6ebb7 nt!KiCommitThreadWait+0x137
    fffff80253a70ad6 nt!KeWaitForSingleObject+0x256
    fffff80253a2aea0 nt!ExfAcquirePushLockExclusiveEx+0x1a0
    fffff80253aee012 nt!ExAcquirePushLockExclusiveEx+0x112
    fffff8025d84112f TestDriver+0x112f
    fffff80253b07167 nt!PspSystemThreadStartup+0x57
    fffff80253c1bb94 nt!KiStartSystemThread+0x34

4 stack(s) with 4 threads displayed (4 Total threads)
```

In this analysis, our initial focus is on the thread identified by **`ffff9101457f2040`**. We've chosen to scrutinize this particular thread as it has been in a wait state for 1 minute and 25.171 seconds on a pushlock. This duration stands out, especially when compared to other threads in the system that have significantly shorter wait times, such as 0 seconds.

```
0: kd> !mex.t ffff9101457f2040
Process                   Thread                       CID       UserTime KernelTime ContextSwitches Wait Reason      Time State
System (ffff91013dcec040) ffff9101457f2040 (E|K|W|R|V) 4.d7c            0      234ms            3187 WrPushLock  1m:25.171 Waiting

WaitBlockList:
    Object           Type                 Other Waiters
    fffff6840aecf280 SynchronizationEvent             0

Priority:
    Current Base Decrement ForegroundBoost IO Page
    9       8    0         0               0  5

# Child-SP         Return           Call Site
0 fffff6840aeceb70 fffff80253a6c9d5 nt!KiSwapContext+0x76
1 fffff6840aececb0 fffff80253a6ebb7 nt!KiSwapThread+0xab5
2 fffff6840aecee00 fffff80253a70ad6 nt!KiCommitThreadWait+0x137
3 fffff6840aeceeb0 fffff80253a2b0ea nt!KeWaitForSingleObject+0x256
4 fffff6840aecf250 fffff80253aedd7c nt!ExfAcquirePushLockSharedEx+0x1ba
5 fffff6840aecf300 fffff8025e5a1230 nt!ExAcquirePushLockSharedEx+0x11c
6 fffff6840aecf350 fffff6840aecf450 <Unloaded_TestDriver.sys>+0x1230
7 fffff6840aecf358 ffff910100000001 0xfffff6840aecf450
8 fffff6840aecf360 fffff8025e5a1e90 0xffff910100000001
9 fffff6840aecf368 00000000000003e7 <Unloaded_TestDriver.sys>+0x1e90
a fffff6840aecf370 fffff6840aecf3c8 0x3e7
b fffff6840aecf378 fffff6840aecf408 0xfffff6840aecf3c8
c fffff6840aecf380 000000000000000f 0xfffff6840aecf408
d fffff6840aecf388 0000000000000000 0xf
```

Let's revisit the address **`ffff9101457f2040`**. Remember, this is a thread address.

```
0: kd> !object ffff9101457f2040
Object: ffff9101457f2040  Type: (ffff91013dcea900) Thread
    ObjectHeader: ffff9101457f2010 (new version)
    HandleCount: 0  PointerCount: 1
```

This output displays detailed information about the **ETHREAD** structure for a specific thread.

```
0: kd> !mex.ddt nt!_ETHREAD ffff910142868040

dt nt!_ETHREAD ffff910142868040 () Recursive: [ -r1 -r2 -r ] Verbose Normal dt
==================================================================================
   +0x000 Tcb                  : _KTHREAD
   +0x480 CreateTime           : _LARGE_INTEGER 0x01da3683`bf03ee04 (12/24/2023 16:10:43 UTC)
   +0x488 ExitTime             : _LARGE_INTEGER 0xffff9101`428684c8 (0n-122040379603768)
   +0x488 KeyedWaitChain       : _LIST_ENTRY [ 0xffff9101`428684c8 - 0xffff9101`428684c8 ] [EMPTY OR 1 ELEMENT]
   +0x498 PostBlockList        : _LIST_ENTRY [ 0x00000000`00000000 - 0xfffff802`5e5a1270 ] [INVALID]
   +0x498 ForwardLinkShadow    : (null)
   +0x4a0 StartAddress         : 0xfffff802`5e5a1270 Void  [generic address]
   +0x4a8 TerminationPort      : (null)
   +0x4a8 ReaperLink           : (null)
   +0x4a8 KeyedWaitValue       : (null)
   +0x4b0 ActiveTimerListLock  : 0
   +0x4b8 ActiveTimerListHead  : _LIST_ENTRY [ 0xffff9101`428684f8 - 0xffff9101`428684f8 ] [EMPTY OR 1 ELEMENT]
   +0x4c8 Cid                  : _CLIENT_ID
   +0x4d8 KeyedWaitSemaphore   : _KSEMAPHORE
   +0x4d8 AlpcWaitSemaphore    : _KSEMAPHORE
   +0x4f8 ClientSecurity       : _PS_CLIENT_SECURITY_CONTEXT
   +0x500 IrpList              : _LIST_ENTRY [ 0xffff9101`42868540 - 0xffff9101`42868540 ] [EMPTY OR 1 ELEMENT]
   +0x510 TopLevelIrp          : 0
   +0x518 DeviceToVerify       : (null)
   +0x520 Win32StartAddress    : 0xfffff802`5e5a1270 Void  [generic address]
   +0x528 ChargeOnlySession    : (null)
   +0x530 LegacyPowerObject    : (null)
   +0x538 ThreadListEntry      : _LIST_ENTRY [ 0xffff9101`44e3a5b8 - 0xffff9101`457f2578 ]
   +0x548 RundownProtect       : _EX_RUNDOWN_REF
   +0x550 ThreadLock           : _EX_PUSH_LOCK
   +0x558 ReadClusterSize      : 7
   +0x55c MmLockOrdering       : 0n0
   +0x560 CrossThreadFlags     : 0x5402 (0n21506)
   +0x560 Terminated           : 0y0
   +0x560 ThreadInserted       : 0y1
   +0x560 HideFromDebugger     : 0y0
   +0x560 ActiveImpersonationInfo : 0y0
   +0x560 HardErrorsAreDisabled : 0y0
   +0x560 BreakOnTermination   : 0y0
   +0x560 SkipCreationMsg      : 0y0
   +0x560 SkipTerminationMsg   : 0y0
   +0x560 CopyTokenOnOpen      : 0y0
   +0x560 ThreadIoPriority     : 0y010 (0n2)
   +0x560 ThreadPagePriority   : 0y101 (0n5)
   +0x560 RundownFail          : 0y0
   +0x560 UmsForceQueueTermination : 0y0
   +0x560 IndirectCpuSets      : 0y0
   +0x560 DisableDynamicCodeOptOut : 0y0
   +0x560 ExplicitCaseSensitivity : 0y0
   +0x560 PicoNotifyExit       : 0y0
   +0x560 DbgWerUserReportActive : 0y0
   +0x560 ForcedSelfTrimActive : 0y0
   +0x560 SamplingCoverage     : 0y0
   +0x560 ReservedCrossThreadFlags : 0y00000000 (0)
   +0x564 SameThreadPassiveFlags : 0
   +0x564 ActiveExWorker       : 0y0
   +0x564 MemoryMaker          : 0y0
   +0x564 StoreLockThread      : 0y00 (0n0)
   +0x564 ClonedThread         : 0y0
   +0x564 KeyedEventInUse      : 0y0
   +0x564 SelfTerminate        : 0y0
   +0x564 RespectIoPriority    : 0y0
   +0x564 ActivePageLists      : 0y0
   +0x564 SecureContext        : 0y0
   +0x564 ZeroPageThread       : 0y0
   +0x564 WorkloadClass        : 0y0
   +0x564 GenerateDumpOnBadHandleAccess : 0y0
   +0x564 ReservedSameThreadPassiveFlags : 0y0000000000000000000 (0)
   +0x568 SameThreadApcFlags   : 0
   +0x568 OwnsProcessAddressSpaceExclusive : 0y0
   +0x568 OwnsProcessAddressSpaceShared : 0y0
   +0x568 HardFaultBehavior    : 0y0
   +0x568 StartAddressInvalid  : 0y0
   +0x568 EtwCalloutActive     : 0y0
   +0x568 SuppressSymbolLoad   : 0y0
   +0x568 Prefetching          : 0y0
   +0x568 OwnsVadExclusive     : 0y0
   +0x569 SystemPagePriorityActive : 0y0
   +0x569 SystemPagePriority   : 0y000 (0n0)
   +0x569 AllowUserWritesToExecutableMemory : 0y0
   +0x569 AllowKernelWritesToExecutableMemory : 0y0
   +0x569 OwnsVadShared        : 0y0
   +0x569 SessionAttachActive  : 0y0
   +0x56a PasidMsrValid        : 0y0
   +0x56c CacheManagerActive   : 0 ''
   +0x56d DisablePageFaultClustering : 0 ''
   +0x56e ActiveFaultCount     : 0 ''
   +0x56f LockOrderState       : 0 ''
   +0x570 PerformanceCountLowReserved : 0
   +0x574 PerformanceCountHighReserved : 0n0
   +0x578 AlpcMessageId        : 0
   +0x580 AlpcMessage          : (null)
   +0x580 AlpcReceiveAttributeSet : 0
   +0x588 AlpcWaitListEntry    : _LIST_ENTRY [ 0x00000000`00000000 - 0x00000000`00000000 ] [INVALID]
   +0x598 ExitStatus           : 0n0
   +0x59c CacheManagerCount    : 0
   +0x5a0 IoBoostCount         : 0
   +0x5a4 IoQoSBoostCount      : 0
   +0x5a8 IoQoSThrottleCount   : 0
   +0x5ac KernelStackReference : 1
   +0x5b0 BoostList            : _LIST_ENTRY [ 0xffff9101`428685f0 - 0xffff9101`428685f0 ] [EMPTY OR 1 ELEMENT]
   +0x5c0 DeboostList          : _LIST_ENTRY [ 0xffff9101`42868600 - 0xffff9101`42868600 ] [EMPTY OR 1 ELEMENT]
   +0x5d0 BoostListLock        : 0
   +0x5d8 IrpListLock          : 0
   +0x5e0 ReservedForSynchTracking : (null)
   +0x5e8 CmCallbackListHead   : _SINGLE_LIST_ENTRY
   +0x5f0 ActivityId           : (null)
   +0x5f8 SeLearningModeListHead : _SINGLE_LIST_ENTRY
   +0x600 VerifierContext      : (null)
   +0x608 AdjustedClientToken  : (null)
   +0x610 WorkOnBehalfThread   : (null)
   +0x618 PropertySet          : _PS_PROPERTY_SET
   +0x630 PicoContext          : (null)
   +0x638 UserFsBase           : 0
   +0x640 UserGsBase           : 0
   +0x648 EnergyValues         : 0xffff9101`42868950 _THREAD_ENERGY_VALUES
   +0x650 SelectedCpuSets      : 0
   +0x650 SelectedCpuSetsIndirect : (null)
   +0x658 Silo                 : 0xffffffff`fffffffd _EJOB
   +0x660 ThreadName           : (null)
   +0x668 SetContextState      : (null)
   +0x670 LastSoftParkElectionQos : 0 ''
   +0x671 LastSoftParkElectionWorkloadType : 0 ''
   +0x672 LastSoftParkElectionRunningType : 0 ''
   +0x673 Spare1               : 0 ''
   +0x674 HeapData             : 0
   +0x678 OwnerEntryListHead   : _LIST_ENTRY [ 0xffff9101`428686b8 - 0xffff9101`428686b8 ] [EMPTY OR 1 ELEMENT]
   +0x688 DisownedOwnerEntryListLock : 0
   +0x690 DisownedOwnerEntryListHead : _LIST_ENTRY [ 0xffff9101`428686d0 - 0xffff9101`428686d0 ] [EMPTY OR 1 ELEMENT]
   +0x6a0 LockEntries          : [6] _KLOCK_ENTRY
   +0x8e0 CmThreadInfo         : (null)
   +0x8e8 FlsData              : (null)
   +0x8f0 LastExpectedRunTime  : 0
   +0x8f4 LastSoftParkElectionRunTime : 0
   +0x8f8 LastSoftParkElectionGeneration : 0
   +0x900 LastSoftParkElectionGroupAffinity : _GROUP_AFFINITY
```

Every thread maintains a fixed list of lock entries. These entries are used to record the locks that the thread is currently holding or waiting on. This list is found in the **ETHREAD** structure's **`LockEntries`** field. To be precise, an array of **`KLOCK_ENTRY`** structures used by the thread for lock management.

```
0: kd> !mex.ddt -a6 ffff910142868040+0x6a0 nt!_KLOCK_ENTRY

dt -a6 ffff910142868040+0x6a0 nt!_KLOCK_ENTRY () Recursive: [ -r1 -r2 -r ] Verbose Normal dt
==================================================================================
[0] @ ffff9101`428686e0 
---------------------------------------------
   +0x000 LockState            : _KLOCK_ENTRY_LOCK_STATE
   +0x000 LockUnsafe           : 0xffff9101`42c9cb70 Void  PoolTag: }..{
   +0x000 CrossThreadReleasableAndBusyByte : 0x70 'p'
   +0x001 Reserved             : [6] "???"
   +0x007 InTreeByte           : 0xff ''
   +0x008 SessionState         : 0x00000000`ffffffff Void    [ !ndao dps dc !handle ln ? ]
   +0x008 SessionId            : 0xffffffff (0n4294967295)
   +0x00c SessionPad           : 0
   +0x010 EntryFlags           : 0x7000100 (0n117440768)
   +0x010 EntryIndex           : 0 ''
   +0x011 WaitingByte          : 0x1 ''
   +0x012 AcquiredByte         : 0 ''
   +0x013 CrossThreadFlags     : 0x7 ''
   +0x013 HeadNodeBit          : 0y1
   +0x013 IoPriorityBit        : 0y1
   +0x013 IoQoSWaiter          : 0y1
   +0x013 Spare1               : 0y00000 (0)
   +0x010 StaticState          : 0y00000000 (0)
   +0x010 AllFlags             : 0y000001110000000000000001 (0x70001)
   +0x014 SpareFlags           : 0
   +0x018 TreeNode             : _RTL_BALANCED_NODE
   +0x030 OwnerTree            : _RTL_RB_TREE
   +0x040 WaiterTree           : _RTL_RB_TREE
   +0x030 CpuPriorityKey       : -8 ''
   +0x050 EntryLock            : 0
   +0x058 BoostBitmap          : _KLOCK_ENTRY_BOOST_BITMAP

[1] @ ffff9101`42868740 
---------------------------------------------
   +0x000 LockState            : _KLOCK_ENTRY_LOCK_STATE
   +0x000 LockUnsafe           : (null)
   +0x000 CrossThreadReleasableAndBusyByte : 0 ''
   +0x001 Reserved             : [6] ""
   +0x007 InTreeByte           : 0 ''
   +0x008 SessionState         : (null)
   +0x008 SessionId            : 0
   +0x00c SessionPad           : 0
   +0x010 EntryFlags           : 1
   +0x010 EntryIndex           : 0x1 ''
   +0x011 WaitingByte          : 0 ''
   +0x012 AcquiredByte         : 0 ''
   +0x013 CrossThreadFlags     : 0 ''
   +0x013 HeadNodeBit          : 0y0
   +0x013 IoPriorityBit        : 0y0
   +0x013 IoQoSWaiter          : 0y0
   +0x013 Spare1               : 0y00000 (0)
   +0x010 StaticState          : 0y00000001 (0x1)
   +0x010 AllFlags             : 0y000000000000000000000000 (0)
   +0x014 SpareFlags           : 0
   +0x018 TreeNode             : _RTL_BALANCED_NODE
   +0x030 OwnerTree            : _RTL_RB_TREE
   +0x040 WaiterTree           : _RTL_RB_TREE
   +0x030 CpuPriorityKey       : 0 ''
   +0x050 EntryLock            : 0
   +0x058 BoostBitmap          : _KLOCK_ENTRY_BOOST_BITMAP

[2] @ ffff9101`428687a0 
---------------------------------------------
   +0x000 LockState            : _KLOCK_ENTRY_LOCK_STATE
   +0x000 LockUnsafe           : (null)
   +0x000 CrossThreadReleasableAndBusyByte : 0 ''
   +0x001 Reserved             : [6] ""
   +0x007 InTreeByte           : 0 ''
   +0x008 SessionState         : (null)
   +0x008 SessionId            : 0
   +0x00c SessionPad           : 0
   +0x010 EntryFlags           : 2
   +0x010 EntryIndex           : 0x2 ''
   +0x011 WaitingByte          : 0 ''
   +0x012 AcquiredByte         : 0 ''
   +0x013 CrossThreadFlags     : 0 ''
   +0x013 HeadNodeBit          : 0y0
   +0x013 IoPriorityBit        : 0y0
   +0x013 IoQoSWaiter          : 0y0
   +0x013 Spare1               : 0y00000 (0)
   +0x010 StaticState          : 0y00000010 (0x2)
   +0x010 AllFlags             : 0y000000000000000000000000 (0)
   +0x014 SpareFlags           : 0
   +0x018 TreeNode             : _RTL_BALANCED_NODE
   +0x030 OwnerTree            : _RTL_RB_TREE
   +0x040 WaiterTree           : _RTL_RB_TREE
   +0x030 CpuPriorityKey       : 0 ''
   +0x050 EntryLock            : 0
   +0x058 BoostBitmap          : _KLOCK_ENTRY_BOOST_BITMAP

[3] @ ffff9101`42868800 
---------------------------------------------
   +0x000 LockState            : _KLOCK_ENTRY_LOCK_STATE
   +0x000 LockUnsafe           : (null)
   +0x000 CrossThreadReleasableAndBusyByte : 0 ''
   +0x001 Reserved             : [6] ""
   +0x007 InTreeByte           : 0 ''
   +0x008 SessionState         : (null)
   +0x008 SessionId            : 0
   +0x00c SessionPad           : 0
   +0x010 EntryFlags           : 3
   +0x010 EntryIndex           : 0x3 ''
   +0x011 WaitingByte          : 0 ''
   +0x012 AcquiredByte         : 0 ''
   +0x013 CrossThreadFlags     : 0 ''
   +0x013 HeadNodeBit          : 0y0
   +0x013 IoPriorityBit        : 0y0
   +0x013 IoQoSWaiter          : 0y0
   +0x013 Spare1               : 0y00000 (0)
   +0x010 StaticState          : 0y00000011 (0x3)
   +0x010 AllFlags             : 0y000000000000000000000000 (0)
   +0x014 SpareFlags           : 0
   +0x018 TreeNode             : _RTL_BALANCED_NODE
   +0x030 OwnerTree            : _RTL_RB_TREE
   +0x040 WaiterTree           : _RTL_RB_TREE
   +0x030 CpuPriorityKey       : 0 ''
   +0x050 EntryLock            : 0
   +0x058 BoostBitmap          : _KLOCK_ENTRY_BOOST_BITMAP

[4] @ ffff9101`42868860 
---------------------------------------------
   +0x000 LockState            : _KLOCK_ENTRY_LOCK_STATE
   +0x000 LockUnsafe           : (null)
   +0x000 CrossThreadReleasableAndBusyByte : 0 ''
   +0x001 Reserved             : [6] ""
   +0x007 InTreeByte           : 0 ''
   +0x008 SessionState         : (null)
   +0x008 SessionId            : 0
   +0x00c SessionPad           : 0
   +0x010 EntryFlags           : 4
   +0x010 EntryIndex           : 0x4 ''
   +0x011 WaitingByte          : 0 ''
   +0x012 AcquiredByte         : 0 ''
   +0x013 CrossThreadFlags     : 0 ''
   +0x013 HeadNodeBit          : 0y0
   +0x013 IoPriorityBit        : 0y0
   +0x013 IoQoSWaiter          : 0y0
   +0x013 Spare1               : 0y00000 (0)
   +0x010 StaticState          : 0y00000100 (0x4)
   +0x010 AllFlags             : 0y000000000000000000000000 (0)
   +0x014 SpareFlags           : 0
   +0x018 TreeNode             : _RTL_BALANCED_NODE
   +0x030 OwnerTree            : _RTL_RB_TREE
   +0x040 WaiterTree           : _RTL_RB_TREE
   +0x030 CpuPriorityKey       : 0 ''
   +0x050 EntryLock            : 0
   +0x058 BoostBitmap          : _KLOCK_ENTRY_BOOST_BITMAP

[5] @ ffff9101`428688c0 
---------------------------------------------
   +0x000 LockState            : _KLOCK_ENTRY_LOCK_STATE
   +0x000 LockUnsafe           : (null)
   +0x000 CrossThreadReleasableAndBusyByte : 0 ''
   +0x001 Reserved             : [6] ""
   +0x007 InTreeByte           : 0 ''
   +0x008 SessionState         : (null)
   +0x008 SessionId            : 0
   +0x00c SessionPad           : 0
   +0x010 EntryFlags           : 5
   +0x010 EntryIndex           : 0x5 ''
   +0x011 WaitingByte          : 0 ''
   +0x012 AcquiredByte         : 0 ''
   +0x013 CrossThreadFlags     : 0 ''
   +0x013 HeadNodeBit          : 0y0
   +0x013 IoPriorityBit        : 0y0
   +0x013 IoQoSWaiter          : 0y0
   +0x013 Spare1               : 0y00000 (0)
   +0x010 StaticState          : 0y00000101 (0x5)
   +0x010 AllFlags             : 0y000000000000000000000000 (0)
   +0x014 SpareFlags           : 0
   +0x018 TreeNode             : _RTL_BALANCED_NODE
   +0x030 OwnerTree            : _RTL_RB_TREE
   +0x040 WaiterTree           : _RTL_RB_TREE
   +0x030 CpuPriorityKey       : 0 ''
   +0x050 EntryLock            : 0
   +0x058 BoostBitmap          : _KLOCK_ENTRY_BOOST_BITMAP
```

In the first lock entry, **`LockUnsafe`** is set to a non-null value **`(0xffff910142c9cb70)`**. This indicates that this particular lock entry is in use with some unsafe conditions. This output shows that the **`_EX_PUSH_LOCK`** at the specified address is currently not locked (neither exclusively nor shared), no threads are waiting for it.

```
0: kd> !mex.ddt nt!_EX_PUSH_LOCK 0xffff9101`42c9cb70

dt nt!_EX_PUSH_LOCK 0xffff9101`42c9cb70 () Recursive: [ -r1 -r2 -r ] Verbose Normal dt
==================================================================================
   +0x000 Locked                   : 0y0
   +0x000 Waiting                  : 0y0
   +0x000 Waking                   : 0y0
   +0x000 MultipleShared           : 0y0
   +0x000 Shared                   : 0y000000000000000000000000000000000000000000000000000000000000 (0)
   +0x000 Value                    : 0
   +0x000 Ptr                      : (null)
```

