# Description

Not releasing a lock that has been acquired is typically considered bad practice in kernel programming, as it can lead to deadlocks or other synchronization issues.

Link to this Memory Dump: https://mega.nz/file/rxtx2LZa#-JnOYyKST2SMstIxIDjk7kC8EbEtvGW-h5KQdUnbwTQ

```c
#include <ntifs.h>
#include <ntstrsafe.h>

typedef struct _SYNC_RESOURCES {
    EX_PUSH_LOCK FilePushLock;
} SYNC_RESOURCES, * PSYNC_RESOURCES;


// Thread function for creating files.
NTSTATUS FileCreationThread(PVOID Context) {
    PSYNC_RESOURCES SyncRes = (PSYNC_RESOURCES)Context;
    UNICODE_STRING uniFilePath;
    WCHAR filePathBuffer[150];
    char dataToWrite[] = "Hello, World!\r\n";
    IO_STATUS_BLOCK ioStatusBlock;

    KeEnterCriticalRegion();  // Disable normal kernel APCs before acquiring Pushlock.
    ExAcquirePushLockExclusive(&SyncRes->FilePushLock); // Acquire Pushlock for exclusive access.

    // Loop to create a series of files.
    for (int i = 0; i < 1000; i++) {
        // Prepare file path.
        RtlStringCchPrintfW(filePathBuffer, sizeof(filePathBuffer) / sizeof(WCHAR), L"\\DosDevices\\C:\\Temp\\file_%d.txt", i);
        RtlInitUnicodeString(&uniFilePath, filePathBuffer);

        // Set up object attributes for the file.
        OBJECT_ATTRIBUTES objAttributes;
        InitializeObjectAttributes(&objAttributes, &uniFilePath, OBJ_CASE_INSENSITIVE | OBJ_KERNEL_HANDLE, NULL, NULL);

        HANDLE hFile;
        // Create the file.

0x1514 0n5396  ffffc78839ecf080 WidgetService.exe                       .  .  .  .  .  .  .
0xa04  0n2564  ffffc78839ef1080 svchost.exe                             .  .  .  .  .  .  .
0x1bd4 0n7124  ffffc78832bca180 vcpkgsrv.exe*32                         .  .  .  .  .  .  .
0x1c3c 0n7228  ffffc7883599e0c0 vcpkgsrv.exe*32                         .  .  .  .  .  .  .
0x2304 0n8964  ffffc7883682b080 dllhost.exe                             .  .  .  .  .  .  .
0x2a30 0n10800 ffffc78832acb080 cmd.exe                                 .  .  1  .  .  .  .
0x2a38 0n10808 ffffc78835ef9080 conhost.exe                             .  .  .  .  .  .  .
0x1cc0 0n7360  ffffc7883c8800c0 SearchProtocolHost.exe                  .  .  .  .  .  .  .
0x1a68 0n6760  ffffc7883becf0c0 MSBuild.exe                             .  .  .  .  .  .  .
0x2580 0n9600  ffffc7883b6eb0c0 conhost.exe                             .  .  .  .  .  .  .
0x81c  0n2076  ffffc7883bfcf0c0 SearchFilterHost.exe                    .  .  .  .  .  .  .
============== ================ ====================================== == == == == == == ==
PID            Address          Name                                   !! Rn Ry Bk Lc IO Er

Warning! Zombie process(es) detected (not displayed). Count: 7 [zombie report]
```

Here we can see that this particular thread is waiting on a pushlock.

```
3: kd> !mex.lt ffffc78831ceb040 -bk -wr WrFastMutex,WrGuardedMutex,WrMutex,WrPushLock
Process PID Thread            Id State   Time Reason
======= === ================ === ======= ==== ==========
System    4 ffffc78838a32040 780 Waiting    0 WrPushLock

Thread Count: 1
```

This thread is waiting on acquiring a pushlock because the lock it requires is not currently available. 

```
3: kd> !mex.t ffffc78838a32040
Process                   Thread                       CID       UserTime KernelTime ContextSwitches Wait Reason Time State
System (ffffc78831ceb040) ffffc78838a32040 (E|K|W|R|V) 4.780            0          0               1 WrPushLock     0 Waiting

WaitBlockList:
    Object           Type                 Other Waiters
    fffffb807d617290 SynchronizationEvent             0

# Child-SP         Return           Call Site
0 fffffb807d616b80 fffff80726a6c9d5 nt!KiSwapContext+0x76
1 fffffb807d616cc0 fffff80726a6ebb7 nt!KiSwapThread+0xab5
2 fffffb807d616e10 fffff80726a70ad6 nt!KiCommitThreadWait+0x137
3 fffffb807d616ec0 fffff80726a2aea0 nt!KeWaitForSingleObject+0x256
4 fffffb807d617260 fffff80726aee012 nt!ExfAcquirePushLockExclusiveEx+0x1a0
5 fffffb807d617310 fffff8074596112f nt!ExAcquirePushLockExclusiveEx+0x112
6 fffffb807d617350 fffff80726b07167 TestDriver+0x112f
7 fffffb807d617570 fffff80726c1bb94 nt!PspSystemThreadStartup+0x57
8 fffffb807d6175c0 0000000000000000 nt!KiStartSystemThread+0x34
```

We are going to examine the **ETHREAD** structure for this specific thread:

```
0: kd> !mex.ddt nt!_ETHREAD ffffc78838a32040

dt nt!_ETHREAD ffffc78838a32040 () Recursive: [ -r1 -r2 -r ] Verbose Normal dt
==================================================================================
   +0x000 Tcb                  : _KTHREAD
   +0x480 CreateTime           : _LARGE_INTEGER 0x01da368d`1b4b470d (12/24/2023 17:17:43 UTC)
   +0x488 ExitTime             : _LARGE_INTEGER 0xffffc788`38a324c8 (0n-62087097015096)
   +0x488 KeyedWaitChain       : _LIST_ENTRY [ 0xffffc788`38a324c8 - 0xffffc788`38a324c8 ] [EMPTY OR 1 ELEMENT]
   +0x498 PostBlockList        : _LIST_ENTRY [ 0x00000000`00000000 - 0xfffff807`459610e0 ] [INVALID]
   +0x498 ForwardLinkShadow    : (null)
   +0x4a0 StartAddress         : 0xfffff807`459610e0 Void  [generic address]
   +0x4a8 TerminationPort      : (null)
   +0x4a8 ReaperLink           : (null)
   +0x4a8 KeyedWaitValue       : (null)
   +0x4b0 ActiveTimerListLock  : 0
   +0x4b8 ActiveTimerListHead  : _LIST_ENTRY [ 0xffffc788`38a324f8 - 0xffffc788`38a324f8 ] [EMPTY OR 1 ELEMENT]
   +0x4c8 Cid                  : _CLIENT_ID
   +0x4d8 KeyedWaitSemaphore   : _KSEMAPHORE
   +0x4d8 AlpcWaitSemaphore    : _KSEMAPHORE
   +0x4f8 ClientSecurity       : _PS_CLIENT_SECURITY_CONTEXT
   +0x500 IrpList              : _LIST_ENTRY [ 0xffffc788`38a32540 - 0xffffc788`38a32540 ] [EMPTY OR 1 ELEMENT]
   +0x510 TopLevelIrp          : 0
   +0x518 DeviceToVerify       : (null)
   +0x520 Win32StartAddress    : 0xfffff807`459610e0 Void  [generic address]
   +0x528 ChargeOnlySession    : (null)
   +0x530 LegacyPowerObject    : (null)
   +0x538 ThreadListEntry      : _LIST_ENTRY [ 0xffffc788`39108578 - 0xffffc788`396517f8 ]
   +0x548 RundownProtect       : _EX_RUNDOWN_REF
   +0x550 ThreadLock           : _EX_PUSH_LOCK
   +0x558 ReadClusterSize      : 7
   +0x55c MmLockOrdering       : 0n0
   +0x560 CrossThreadFlags     : 0x5402 (0n21506)
   +0x560 Terminated           : 0y0
   +0x560 ThreadInserted       : 0y1
   +0x560 HideFromDebugger     : 0y0
   +0x560 ActiveImpersonationInfo : 0y0
   +0x560 HardErrorsAreDisabled : 0y0
   +0x560 BreakOnTermination   : 0y0
   +0x560 SkipCreationMsg      : 0y0
   +0x560 SkipTerminationMsg   : 0y0
   +0x560 CopyTokenOnOpen      : 0y0
   +0x560 ThreadIoPriority     : 0y010 (0n2)
   +0x560 ThreadPagePriority   : 0y101 (0n5)
   +0x560 RundownFail          : 0y0
   +0x560 UmsForceQueueTermination : 0y0
   +0x560 IndirectCpuSets      : 0y0
   +0x560 DisableDynamicCodeOptOut : 0y0
   +0x560 ExplicitCaseSensitivity : 0y0
   +0x560 PicoNotifyExit       : 0y0
   +0x560 DbgWerUserReportActive : 0y0
   +0x560 ForcedSelfTrimActive : 0y0
   +0x560 SamplingCoverage     : 0y0
   +0x560 ReservedCrossThreadFlags : 0y00000000 (0)
   +0x564 SameThreadPassiveFlags : 0
   +0x564 ActiveExWorker       : 0y0
   +0x564 MemoryMaker          : 0y0
   +0x564 StoreLockThread      : 0y00 (0n0)
   +0x564 ClonedThread         : 0y0
   +0x564 KeyedEventInUse      : 0y0
   +0x564 SelfTerminate        : 0y0
   +0x564 RespectIoPriority    : 0y0
   +0x564 ActivePageLists      : 0y0
   +0x564 SecureContext        : 0y0
   +0x564 ZeroPageThread       : 0y0
   +0x564 WorkloadClass        : 0y0
   +0x564 GenerateDumpOnBadHandleAccess : 0y0
   +0x564 ReservedSameThreadPassiveFlags : 0y0000000000000000000 (0)
   +0x568 SameThreadApcFlags   : 0
   +0x568 OwnsProcessAddressSpaceExclusive : 0y0
   +0x568 OwnsProcessAddressSpaceShared : 0y0
   +0x568 HardFaultBehavior    : 0y0
   +0x568 StartAddressInvalid  : 0y0
   +0x568 EtwCalloutActive     : 0y0
   +0x568 SuppressSymbolLoad   : 0y0
   +0x568 Prefetching          : 0y0
   +0x568 OwnsVadExclusive     : 0y0
   +0x569 SystemPagePriorityActive : 0y0
   +0x569 SystemPagePriority   : 0y000 (0n0)
   +0x569 AllowUserWritesToExecutableMemory : 0y0
   +0x569 AllowKernelWritesToExecutableMemory : 0y0
   +0x569 OwnsVadShared        : 0y0
   +0x569 SessionAttachActive  : 0y0
   +0x56a PasidMsrValid        : 0y0
   +0x56c CacheManagerActive   : 0 ''
   +0x56d DisablePageFaultClustering : 0 ''
   +0x56e ActiveFaultCount     : 0 ''
   +0x56f LockOrderState       : 0 ''
   +0x570 PerformanceCountLowReserved : 0
   +0x574 PerformanceCountHighReserved : 0n0
   +0x578 AlpcMessageId        : 0
   +0x580 AlpcMessage          : (null)
   +0x580 AlpcReceiveAttributeSet : 0
   +0x588 AlpcWaitListEntry    : _LIST_ENTRY [ 0x00000000`00000000 - 0x00000000`00000000 ] [INVALID]
   +0x598 ExitStatus           : 0n0
   +0x59c CacheManagerCount    : 0
   +0x5a0 IoBoostCount         : 0
   +0x5a4 IoQoSBoostCount      : 0
   +0x5a8 IoQoSThrottleCount   : 0
   +0x5ac KernelStackReference : 1
   +0x5b0 BoostList            : _LIST_ENTRY [ 0xffffc788`38a325f0 - 0xffffc788`38a325f0 ] [EMPTY OR 1 ELEMENT]
   +0x5c0 DeboostList          : _LIST_ENTRY [ 0xffffc788`38a32600 - 0xffffc788`38a32600 ] [EMPTY OR 1 ELEMENT]
   +0x5d0 BoostListLock        : 0
   +0x5d8 IrpListLock          : 0
   +0x5e0 ReservedForSynchTracking : (null)
   +0x5e8 CmCallbackListHead   : _SINGLE_LIST_ENTRY
   +0x5f0 ActivityId           : (null)
   +0x5f8 SeLearningModeListHead : _SINGLE_LIST_ENTRY
   +0x600 VerifierContext      : (null)
   +0x608 AdjustedClientToken  : (null)
   +0x610 WorkOnBehalfThread   : (null)
   +0x618 PropertySet          : _PS_PROPERTY_SET
   +0x630 PicoContext          : (null)
   +0x638 UserFsBase           : 0
   +0x640 UserGsBase           : 0
   +0x648 EnergyValues         : 0xffffc788`38a32950 _THREAD_ENERGY_VALUES
   +0x650 SelectedCpuSets      : 0
   +0x650 SelectedCpuSetsIndirect : (null)
   +0x658 Silo                 : 0xffffffff`fffffffd _EJOB
   +0x660 ThreadName           : (null)
   +0x668 SetContextState      : (null)
   +0x670 LastSoftParkElectionQos : 0 ''
   +0x671 LastSoftParkElectionWorkloadType : 0 ''
   +0x672 LastSoftParkElectionRunningType : 0 ''
   +0x673 Spare1               : 0 ''
   +0x674 HeapData             : 0
   +0x678 OwnerEntryListHead   : _LIST_ENTRY [ 0xffffc788`38a326b8 - 0xffffc788`38a326b8 ] [EMPTY OR 1 ELEMENT]
   +0x688 DisownedOwnerEntryListLock : 0
   +0x690 DisownedOwnerEntryListHead : _LIST_ENTRY [ 0xffffc788`38a326d0 - 0xffffc788`38a326d0 ] [EMPTY OR 1 ELEMENT]
   +0x6a0 LockEntries          : [6] _KLOCK_ENTRY
   +0x8e0 CmThreadInfo         : (null)
   +0x8e8 FlsData              : (null)
   +0x8f0 LastExpectedRunTime  : 0
   +0x8f4 LastSoftParkElectionRunTime : 0
   +0x8f8 LastSoftParkElectionGeneration : 0
   +0x900 LastSoftParkElectionGroupAffinity : _GROUP_AFFINITY
```

Every thread maintains a fixed list of lock entries. These entries are used to record the locks that the thread is currently holding or waiting on. This list is found in the **ETHREAD** structure's **`LockEntries`** field. To be precise, an array of **`KLOCK_ENTRY`** structures used by the thread for lock management.

```
0: kd> !mex.ddt -a6 ffffc78838a32040+0x6a0 nt!_KLOCK_ENTRY

dt -a6 ffffc78838a32040+0x6a0 nt!_KLOCK_ENTRY () Recursive: [ -r1 -r2 -r ] Verbose Normal dt
==================================================================================
[0] @ ffffc788`38a326e0 
---------------------------------------------
   +0x000 LockState            : _KLOCK_ENTRY_LOCK_STATE
   +0x000 LockUnsafe           : 0xffffc788`3a0f6f70 Void  PoolTag: Devi
   +0x000 CrossThreadReleasableAndBusyByte : 0x70 'p'
   +0x001 Reserved             : [6] "o???"
   +0x007 InTreeByte           : 0xff ''
   +0x008 SessionState         : 0x00000000`ffffffff Void    [ !ndao dps dc !handle ln ? ]
   +0x008 SessionId            : 0xffffffff (0n4294967295)
   +0x00c SessionPad           : 0
   +0x010 EntryFlags           : 0x7000100 (0n117440768)
   +0x010 EntryIndex           : 0 ''
   +0x011 WaitingByte          : 0x1 '' --> Indicates whether a thread is waiting to acquire the associated lock
   +0x012 AcquiredByte         : 0 ''
   +0x013 CrossThreadFlags     : 0x7 ''
   +0x013 HeadNodeBit          : 0y1
   +0x013 IoPriorityBit        : 0y1
   +0x013 IoQoSWaiter          : 0y1
   +0x013 Spare1               : 0y00000 (0)
   +0x010 StaticState          : 0y00000000 (0)
   +0x010 AllFlags             : 0y000001110000000000000001 (0x70001)
   +0x014 SpareFlags           : 0
   +0x018 TreeNode             : _RTL_BALANCED_NODE
   +0x030 OwnerTree            : _RTL_RB_TREE
   +0x040 WaiterTree           : _RTL_RB_TREE
   +0x030 CpuPriorityKey       : -8 ''
   +0x050 EntryLock            : 0
   +0x058 BoostBitmap          : _KLOCK_ENTRY_BOOST_BITMAP

[1] @ ffffc788`38a32740 
---------------------------------------------
   +0x000 LockState            : _KLOCK_ENTRY_LOCK_STATE
   +0x000 LockUnsafe           : (null)
   +0x000 CrossThreadReleasableAndBusyByte : 0 ''
   +0x001 Reserved             : [6] ""
   +0x007 InTreeByte           : 0 ''
   +0x008 SessionState         : (null)
   +0x008 SessionId            : 0
   +0x00c SessionPad           : 0
   +0x010 EntryFlags           : 1
   +0x010 EntryIndex           : 0x1 ''
   +0x011 WaitingByte          : 0 ''
   +0x012 AcquiredByte         : 0 ''
   +0x013 CrossThreadFlags     : 0 ''
   +0x013 HeadNodeBit          : 0y0
   +0x013 IoPriorityBit        : 0y0
   +0x013 IoQoSWaiter          : 0y0
   +0x013 Spare1               : 0y00000 (0)
   +0x010 StaticState          : 0y00000001 (0x1)
   +0x010 AllFlags             : 0y000000000000000000000000 (0)
   +0x014 SpareFlags           : 0
   +0x018 TreeNode             : _RTL_BALANCED_NODE
   +0x030 OwnerTree            : _RTL_RB_TREE
   +0x040 WaiterTree           : _RTL_RB_TREE
   +0x030 CpuPriorityKey       : 0 ''
   +0x050 EntryLock            : 0
   +0x058 BoostBitmap          : _KLOCK_ENTRY_BOOST_BITMAP

[2] @ ffffc788`38a327a0 
---------------------------------------------
   +0x000 LockState            : _KLOCK_ENTRY_LOCK_STATE
   +0x000 LockUnsafe           : (null)
   +0x000 CrossThreadReleasableAndBusyByte : 0 ''
   +0x001 Reserved             : [6] ""
   +0x007 InTreeByte           : 0 ''
   +0x008 SessionState         : (null)
   +0x008 SessionId            : 0
   +0x00c SessionPad           : 0
   +0x010 EntryFlags           : 2
   +0x010 EntryIndex           : 0x2 ''
   +0x011 WaitingByte          : 0 ''
   +0x012 AcquiredByte         : 0 ''
   +0x013 CrossThreadFlags     : 0 ''
   +0x013 HeadNodeBit          : 0y0
   +0x013 IoPriorityBit        : 0y0
   +0x013 IoQoSWaiter          : 0y0
   +0x013 Spare1               : 0y00000 (0)
   +0x010 StaticState          : 0y00000010 (0x2)
   +0x010 AllFlags             : 0y000000000000000000000000 (0)
   +0x014 SpareFlags           : 0
   +0x018 TreeNode             : _RTL_BALANCED_NODE
   +0x030 OwnerTree            : _RTL_RB_TREE
   +0x040 WaiterTree           : _RTL_RB_TREE
   +0x030 CpuPriorityKey       : 0 ''
   +0x050 EntryLock            : 0
   +0x058 BoostBitmap          : _KLOCK_ENTRY_BOOST_BITMAP

[3] @ ffffc788`38a32800 
---------------------------------------------
   +0x000 LockState            : _KLOCK_ENTRY_LOCK_STATE
   +0x000 LockUnsafe           : (null)
   +0x000 CrossThreadReleasableAndBusyByte : 0 ''
   +0x001 Reserved             : [6] ""
   +0x007 InTreeByte           : 0 ''
   +0x008 SessionState         : (null)
   +0x008 SessionId            : 0
   +0x00c SessionPad           : 0
   +0x010 EntryFlags           : 3
   +0x010 EntryIndex           : 0x3 ''
   +0x011 WaitingByte          : 0 ''
   +0x012 AcquiredByte         : 0 ''
   +0x013 CrossThreadFlags     : 0 ''
   +0x013 HeadNodeBit          : 0y0
   +0x013 IoPriorityBit        : 0y0
   +0x013 IoQoSWaiter          : 0y0
   +0x013 Spare1               : 0y00000 (0)
   +0x010 StaticState          : 0y00000011 (0x3)
   +0x010 AllFlags             : 0y000000000000000000000000 (0)
   +0x014 SpareFlags           : 0
   +0x018 TreeNode             : _RTL_BALANCED_NODE
   +0x030 OwnerTree            : _RTL_RB_TREE
   +0x040 WaiterTree           : _RTL_RB_TREE
   +0x030 CpuPriorityKey       : 0 ''
   +0x050 EntryLock            : 0
   +0x058 BoostBitmap          : _KLOCK_ENTRY_BOOST_BITMAP

[4] @ ffffc788`38a32860 
---------------------------------------------
   +0x000 LockState            : _KLOCK_ENTRY_LOCK_STATE
   +0x000 LockUnsafe           : (null)
   +0x000 CrossThreadReleasableAndBusyByte : 0 ''
   +0x001 Reserved             : [6] ""
   +0x007 InTreeByte           : 0 ''
   +0x008 SessionState         : (null)
   +0x008 SessionId            : 0
   +0x00c SessionPad           : 0
   +0x010 EntryFlags           : 4
   +0x010 EntryIndex           : 0x4 ''
   +0x011 WaitingByte          : 0 ''
   +0x012 AcquiredByte         : 0 ''
   +0x013 CrossThreadFlags     : 0 ''
   +0x013 HeadNodeBit          : 0y0
   +0x013 IoPriorityBit        : 0y0
   +0x013 IoQoSWaiter          : 0y0
   +0x013 Spare1               : 0y00000 (0)
   +0x010 StaticState          : 0y00000100 (0x4)
   +0x010 AllFlags             : 0y000000000000000000000000 (0)
   +0x014 SpareFlags           : 0
   +0x018 TreeNode             : _RTL_BALANCED_NODE
   +0x030 OwnerTree            : _RTL_RB_TREE
   +0x040 WaiterTree           : _RTL_RB_TREE
   +0x030 CpuPriorityKey       : 0 ''
   +0x050 EntryLock            : 0
   +0x058 BoostBitmap          : _KLOCK_ENTRY_BOOST_BITMAP

[5] @ ffffc788`38a328c0 
---------------------------------------------
   +0x000 LockState            : _KLOCK_ENTRY_LOCK_STATE
   +0x000 LockUnsafe           : (null)
   +0x000 CrossThreadReleasableAndBusyByte : 0 ''
   +0x001 Reserved             : [6] ""
   +0x007 InTreeByte           : 0 ''
   +0x008 SessionState         : (null)
   +0x008 SessionId            : 0
   +0x00c SessionPad           : 0
   +0x010 EntryFlags           : 5
   +0x010 EntryIndex           : 0x5 ''
   +0x011 WaitingByte          : 0 ''
   +0x012 AcquiredByte         : 0 ''
   +0x013 CrossThreadFlags     : 0 ''
   +0x013 HeadNodeBit          : 0y0
   +0x013 IoPriorityBit        : 0y0
   +0x013 IoQoSWaiter          : 0y0
   +0x013 Spare1               : 0y00000 (0)
   +0x010 StaticState          : 0y00000101 (0x5)
   +0x010 AllFlags             : 0y000000000000000000000000 (0)
   +0x014 SpareFlags           : 0
   +0x018 TreeNode             : _RTL_BALANCED_NODE
   +0x030 OwnerTree            : _RTL_RB_TREE
   +0x040 WaiterTree           : _RTL_RB_TREE
   +0x030 CpuPriorityKey       : 0 ''
   +0x050 EntryLock            : 0
   +0x058 BoostBitmap          : _KLOCK_ENTRY_BOOST_BITMAP
```

The **`WaitingByte`** indicates whether a thread is waiting to acquire the associated lock. If the **`WaitingByte`** is set (e.g., a non-zero value), it means that at least one thread is waiting for the lock to be released.

```
3: kd> !mex.ddt ffffc78838a32040+0x6a0 nt!_KLOCK_ENTRY -y WaitingByte

dt ffffc78838a32040+0x6a0 nt!_KLOCK_ENTRY -y WaitingByte () Recursive: [ -r1 -r2 -r ] Verbose Normal dt
==================================================================================
   +0x011 WaitingByte              : 0x1 '' --> Indicates whether a thread is waiting to acquire the associated lock
```

In the first lock entry, **`LockUnsafe`** is set to a non-null value **`0xffffc7883a0f6f70`**. This indicates that this particular lock entry is in use with some unsafe conditions.

